### (1) データベースの作成

In [1]:
# SQLite のモジュールをインポートする
import sqlite3
 
# Club.db に接続する
conn = sqlite3.connect("Club.db", isolation_level=None)

# "Members" テーブルを作成する (id, name, age, hometown) 
# VARCHAR: 可変長文字列型, INTEGER: 整数, REAL: 実数
sql="""
CREATE TABLE Members (
    id VARCHAR(4), 
    name VARCHAR(30), 
    age INTEGER, 
    hometown VARCHAR(20), 
    year REAL
);
"""

conn.execute(sql)

### (2) テーブル作成のやり直し

In [2]:
# データを作り直したいときには、次のコマンドを実行し、
# 「(1) データベースの作成」の "Members" テーブルを作成する一連のコマンドを、改めて実行する。
# その後、以下の「(3) レコードの登録」以降が、実行可能になる。
# 実際に実行するには、コメント記号(#)を除いてから実行する。
#conn.execute("DROP TABLE Members;")

### (3) レコードの登録

In [3]:
# レコードを登録する(1)
conn.execute("INSERT INTO Members VALUES (1001, '佐藤一郎', 25, '京都', 1.5);")

# 次のように、SQL文を、いったん、、別の変数に格納してから、conn.execute(sql) とすることも可能
# sql = "INSERT INTO Members VALUES (1001, '佐藤一郎', 25, '京都', 1.5);"
# conn.execute(sql)
#
# また、csvファイルなどにまとめたレコードを登録することもできるが、今回の演習では、
# レコードを一つずつ登録することで、登録のやり方を練習する。

In [4]:
# データを登録する(2)
conn.execute("INSERT INTO Members VALUES (1015, '鈴木花子', 40, '京都', 12.0);")

In [5]:
# データを登録する(3)
conn.execute("INSERT INTO Members VALUES (1027, 'Mary Scott', 33, 'New York', 6.25);")

In [6]:
# データを登録する(4)
conn.execute("INSERT INTO Members VALUES (1033, 'Kevin Nelson', 45, 'London', 15.5);")

In [7]:
# データを登録する(5)
conn.execute("INSERT INTO Members VALUES (1038, '田中太郎', 37, '京都', 8.75);")

In [8]:
# データを登録する(6)
conn.execute("INSERT INTO Members VALUES (1041, 'Jack Liu', 28, 'New York', 3.25);")

In [9]:
# データを登録する(7)
conn.execute("INSERT INTO Members VALUES (1052, 'Jiaxin Zhang', 36, 'Beijing', 5.0);")

In [10]:
# 次のように、一度に登録することもできる (実際に実行するときは、コメントの記号 "#" を除く)
#conn.execute("INSERT INTO Members VALUES (1001, '佐藤一郎', 25, '京都', 1.5);")
#conn.execute("INSERT INTO Members VALUES (1015, '鈴木花子', 40, '京都', 12.0);")
#conn.execute("INSERT INTO Members VALUES (1027, 'Mary Scott', 33, 'New York', 6.25);")
#conn.execute("INSERT INTO Members VALUES (1033, 'Kevin Nelson', 45, 'London', 15.5);")
#conn.execute("INSERT INTO Members VALUES (1038, '田中太郎', 37, '京都', 8.75);")
#conn.execute("INSERT INTO Members VALUES (1041, 'Jack Liu', 28, 'New York', 3.25);")
#conn.execute("INSERT INTO Members VALUES (1052, 'Jiaxin Zhang', 36, 'Beijing', 5.0);")

### (4) 登録したレコードの表示

In [11]:
# 登録したデータを取得して表示する
c=conn.cursor()
c.execute("SELECT * FROM Members;")
for row in c:
    print(row)

('1001', '佐藤一郎', 25, '京都', 1.5)
('1015', '鈴木花子', 40, '京都', 12.0)
('1027', 'Mary Scott', 33, 'New York', 6.25)
('1033', 'Kevin Nelson', 45, 'London', 15.5)
('1038', '田中太郎', 37, '京都', 8.75)
('1041', 'Jack Liu', 28, 'New York', 3.25)
('1052', 'Jiaxin Zhang', 36, 'Beijing', 5.0)

### (5) データベースへの接続の終了

In [12]:
# データベースを閉じる（データベースを使い終わったときに、閉じる）
# 「(1) データベースの作成」の conn = sqlite3.connect("Club.db", isolation_level=None) に対応
conn.close();

### (6) データベースへの再接続

In [13]:
# もう一度、データベース(Club.db)を使用するために、改めて接続する

# SQLite のモジュールをインポートする
import sqlite3
 
# いったん、データベース(Club.db)を閉じたので、もう一度接続する
conn = sqlite3.connect("Club.db", isolation_level=None)

In [14]:
#きちんとデータベース(Club.db)に接続でき、テーブル(Members)を読み込むことができるかを確認
c=conn.cursor()
c.execute("SELECT * FROM Members;")
for row in c:
    print(row)

('1001', '佐藤一郎', 25, '京都', 1.5)
('1015', '鈴木花子', 40, '京都', 12.0)
('1027', 'Mary Scott', 33, 'New York', 6.25)
('1033', 'Kevin Nelson', 45, 'London', 15.5)
('1038', '田中太郎', 37, '京都', 8.75)
('1041', 'Jack Liu', 28, 'New York', 3.25)
('1052', 'Jiaxin Zhang', 36, 'Beijing', 5.0)

### (7) SQL (Structured Query Language) の使用例

In [15]:
# 特定のレコードを取得する例
# 「京都」出身者のレコードを取得する
sql="SELECT * FROM Members WHERE hometown='京都';"
c=conn.execute(sql)
for row in c:
    print (row)

('1001', '佐藤一郎', 25, '京都', 1.5)
('1015', '鈴木花子', 40, '京都', 12.0)
('1038', '田中太郎', 37, '京都', 8.75)

In [16]:
# 年齢の平均を計算する
sql="SELECT avg(age) FROM Members;"
c.execute(sql)
row = c.fetchone()
print(row[0])

34.857142857142854

In [17]:
# 年齢の降順(descending order)に並べる
sql="SELECT name, age from Members ORDER BY age DESC;"
c.execute(sql)
for row in c: 
    print (row)

('Kevin Nelson', 45)
('鈴木花子', 40)
('田中太郎', 37)
('Jiaxin Zhang', 36)
('Mary Scott', 33)
('Jack Liu', 28)
('佐藤一郎', 25)

In [18]:
# 年齢の昇順(ascending order)に並べる
sql="SELECT name, age from Members ORDER BY age ASC;"
c.execute(sql)
for row in c: 
    print (row)

('佐藤一郎', 25)
('Jack Liu', 28)
('Mary Scott', 33)
('Jiaxin Zhang', 36)
('田中太郎', 37)
('鈴木花子', 40)
('Kevin Nelson', 45)

In [19]:
# 35歳未満のメンバーのレコードを取得する
sql="SELECT * FROM Members WHERE age<35;"
c.execute(sql)
for row in c: 
    print (row)

('1001', '佐藤一郎', 25, '京都', 1.5)
('1027', 'Mary Scott', 33, 'New York', 6.25)
('1041', 'Jack Liu', 28, 'New York', 3.25)

In [20]:
# 年齢の最大値を表示する
sql="SELECT MAX(age) FROM Members;"
c.execute(sql)
row = c.fetchone()
print(row[0])

45

In [21]:
# 年齢の最小値を表示する
sql="SELECT MIN(age) FROM Members;"
c.execute(sql)
row = c.fetchone()
print(row[0])

25

In [22]:
# Membersテーブルをhometownでグループ化して、hometownの名前と、それぞれのレコード数を取得する
sql= "SELECT hometown, count(*) FROM Members GROUP BY hometown;"
c.execute(sql)
for row in c: 
    print (row)

('Beijing', 1)
('London', 1)
('New York', 2)
('京都', 3)

In [23]:
# Membersテーブルをhometownでグループ化して、hometownの名前と、そのhometown出身者の平均年齢を計算する
sql= "SELECT hometown, AVG(age) FROM Members GROUP BY hometown;"
c.execute(sql)
for row in c: 
    print (row)

('Beijing', 36.0)
('London', 45.0)
('New York', 30.5)
('京都', 34.0)